session1/exercice/data-structures-C.org
# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; ispell-local-dictionary: "fr_FR";-*-

#+TITLE: Chargement et sélection de données en Java : élements de correction
#+AUTHOR: Bernard Hugueney

#+LANGUAGE: fr
#+LANG: fr

#+BEGIN_SRC elisp :exports none :results silent
 (setq org-ditaa-jar-path "/usr/share/ditaa/ditaa.jar")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((ditaa . t)
   (java . t)
   (python . t)))
#+END_SRC



* Modélisation

La principale question est de décider comment on va représenter les coordonnées géographiques. Il y a trois possibilités (en plus du fait de choisir un type src_java[:exports code]{float} ou src_java[:exports code]{double] pour les latitudes et longitudes) :
- les représenter juste par deux nombres distincts
- les regrouper :
  - dans un tableau de deux cases
  - dans une classe dédiée (par exemple src_java[:exports
    code]{GeoCoords}).

Il s'agit de différents compromis entre facilité, simplicité et performance. Les problèmes posés par le fait de ne pas regrouper les coordonnées sont :
- il faudra faire attention à l'ordre dans lequel on passe les
  paramètres à chaque fois (même si l'IDE peut nous aider)
- pour la méthode qui implémentera l'opération «trouver les communes
  qui sont simultanément dans un rayon donnée d'un ensemble de points
  quelconques repérés par leur latitude et longitude.», il ne sera pas
  commode de passer ces points.

Un tableau de deux cases peut résoudre le problème, mais le
compilateur ne pourra pas vérifier que le tableau fait effectivement
deux cases. *ATTENTION !* Si l'on utilise un tableau comme attribut de
notre classe src_java[:exports code]{City}, il faut se poser la
question de l'égalité et du hashage de tableaux (utiliser
[[https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#equals-double:A-double:A-][Arrays.equals]] et non le src_java[:exports code]{equals} qui est [[https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#equals-java.lang.Object-][celui
de Object]], et [[https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#hashCode-double:A-][Arrays.hashCode]] et non le src_java[:exports
code]{hashCode} qui est [[https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#hashCode--][celui de Object]]).

On peut aussi se demander si l'on a besoin d'une classe pour modéliser
les ou les ensembles de communes. À priori, cela ne semble pas
nécessaire.


* Implémentation

** Fonctionnalités de base

*** equals

*** hashCode

** Fonctionnalités demandées

Certaines opérations qui se réfèrent à une commune en particulier, on
les implémentera donc sous la forme de méthodes d'instance. Pour les
autres, on utilisera des méthodes de classe. Pour les ensembles de
communes acceptés en argument et retournés, on doit se demander le
type à utiliser. Pour le type acceptés, on voudra utiliser l'interface
la plus générique : [[https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html][Collection]]. Pour les types retournés, on doit
décider si l'on veut supprimer les doublons et/ou si l'on veut pouvoir
faire efficacement des intersections. Dans ces cas, on utilisera des
[[https://docs.oracle.com/javase/8/docs/api/java/util/Set.html][Set]] (par exemple [[https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html][HashSet]] si l'on a pas d'ordre à gérer). Sinon, on
pourra utiliser des [[https://docs.oracle.com/javase/7/docs/api/java/util/ArrayList.html][ArrayList]] qu'on pourra retourner en tant que [[https://docs.oracle.com/javase/7/docs/api/java/util/List.html][List]],
voire [[https://docs.oracle.com/javase/7/docs/api/java/util/Collection.html][Collection]]. Retourner une  [[https://docs.oracle.com/javase/7/docs/api/java/util/List.html][List]] permet de faire plus de choses, mais 

