session1/exercice/data-structures-C.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-11-14 Thu 23:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chargement et sélection de données en Java : élements de correction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Chargement et sélection de données en Java : élements de correction</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org13168c4">1. Modélisation</a></li>
<li><a href="#org53ed3e4">2. Implémentation</a>
<ul>
<li><a href="#orge72194b">2.1. Fonctionnalités de base</a>
<ul>
<li><a href="#org698b431">2.1.1. equals</a></li>
<li><a href="#org83eb97c">2.1.2. hashCode</a></li>
</ul>
</li>
<li><a href="#org08f72c6">2.2. Fonctionnalités demandées</a>
<ul>
<li><a href="#org7ea23e0">2.2.1. distance d'une commune à un point</a></li>
<li><a href="#org0e268f3">2.2.2. distance d'une commune à une autre</a></li>
<li><a href="#org4cdb9f5">2.2.3. commune la plus proche</a></li>
<li><a href="#org3d9af60">2.2.4. communes dans un rayon par rapport à un point</a></li>
<li><a href="#orge4092e8">2.2.5. Communes dans un rayon par rapport à un ensemble de points</a></li>
</ul>
</li>
<li><a href="#orgc27a697">2.3. Lecture des données</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org13168c4" class="outline-2">
<h2 id="org13168c4"><span class="section-number-2">1</span> Modélisation</h2>
<div class="outline-text-2" id="text-1">
<p>
La principale question est de décider comment on va représenter les coordonnées géographiques. Il y a trois possibilités (en plus du fait de choisir un type <code class="src src-java"><span style="color: #6434A3;">float</span></code> ou src_java[:exports code]{double] pour les latitudes et longitudes) :
</p>
<ul class="org-ul">
<li>les représenter juste par deux nombres distincts</li>
<li>les regrouper :
<ul class="org-ul">
<li>dans un tableau de deux cases</li>
<li>dans une classe dédiée (par exemple <code class="src src-java">GeoCoords</code>).</li>
</ul></li>
</ul>

<p>
Il s'agit de différents compromis entre facilité, simplicité et performance. Les problèmes posés par le fait de ne pas regrouper les coordonnées sont :
</p>
<ul class="org-ul">
<li>il faudra faire attention à l'ordre dans lequel on passe les
paramètres à chaque fois (même si l'IDE peut nous aider)</li>
<li>pour la méthode qui implémentera l'opération «trouver les communes
qui sont simultanément dans un rayon donnée d'un ensemble de points
quelconques repérés par leur latitude et longitude.», il ne sera pas
commode de passer ces points.</li>
</ul>

<p>
Un tableau de deux cases peut résoudre le problème, mais le
compilateur ne pourra pas vérifier que le tableau fait effectivement
deux cases. <b>ATTENTION !</b> Si l'on utilise un tableau comme attribut de
notre classe <code class="src src-java">City</code>, il faut se poser la
question de l'égalité et du hashage de tableaux (utiliser
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#equals-double:A-double:A-">Arrays.equals</a> et non le <code class="src src-java">equals</code> qui est <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#equals-java.lang.Object-">celui
de Object</a>, et <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#hashCode-double:A-">Arrays.hashCode</a> et non le <code class="src src-java">hashCode</code> qui est <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#hashCode--">celui de Object</a>).
</p>

<p>
On peut aussi se demander si l'on a besoin d'une classe pour modéliser
les ou les ensembles de communes. À priori, cela ne semble pas
nécessaire.
</p>
</div>
</div>


<div id="outline-container-org53ed3e4" class="outline-2">
<h2 id="org53ed3e4"><span class="section-number-2">2</span> Implémentation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge72194b" class="outline-3">
<h3 id="orge72194b"><span class="section-number-3">2.1</span> Fonctionnalités de base</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org698b431" class="outline-4">
<h4 id="org698b431"><span class="section-number-4">2.1.1</span> equals</h4>
</div>

<div id="outline-container-org83eb97c" class="outline-4">
<h4 id="org83eb97c"><span class="section-number-4">2.1.2</span> hashCode</h4>
</div>
</div>

<div id="outline-container-org08f72c6" class="outline-3">
<h3 id="org08f72c6"><span class="section-number-3">2.2</span> Fonctionnalités demandées</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Certaines opérations qui se réfèrent à une commune en particulier, on
les implémentera donc sous la forme de méthodes d'instance. Pour les
autres, on utilisera des méthodes de classe. Pour les ensembles de
communes acceptés en argument et retournés, on doit se demander le
type à utiliser. Pour le type acceptés, on voudra utiliser l'interface
la plus générique : <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html">Collection</a>. Pour les types retournés, on doit
décider si l'on veut supprimer les doublons et/ou si l'on veut pouvoir
faire efficacement des intersections. Dans ces cas, on utilisera des
<a href="https://docs.oracle.com/javase/8/docs/api/java/util/Set.html">Set</a> (par exemple <a href="https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html">HashSet</a> si l'on a pas d'ordre à gérer). Sinon, on
pourra utiliser des <a href="https://docs.oracle.com/javase/7/docs/api/java/util/ArrayList.html">ArrayList</a> qu'on pourra retourner en tant que <a href="https://docs.oracle.com/javase/7/docs/api/java/util/List.html">List</a>,
voire <a href="https://docs.oracle.com/javase/7/docs/api/java/util/Collection.html">Collection</a>. Retourner une  <a href="https://docs.oracle.com/javase/7/docs/api/java/util/List.html">List</a> permet de faire plus de choses, mais 
</p>
</div>
