session1/exercice/data-structures-C.md
- [Modélisation](#org9d548e7)
- [Implémentation](#org8065b7b)
  - [Fonctionnalités de base](#org863c430)
    - [equals](#org0d82793)
    - [hashCode](#orge0e0966)
  - [Fonctionnalités demandées](#orga315f7c)
    - [distance d'une commune à un point](#orgf60a025)
    - [distance d'une commune à une autre](#org749e156)
    - [commune la plus proche](#org2a37e45)
    - [communes dans un rayon par rapport à un point](#orgb57efad)
    - [Communes dans un rayon par rapport à un ensemble de points](#org1b452cb)
  - [Lecture des données](#org84921f2)



<a id="org9d548e7"></a>

# Modélisation

La principale question est de décider comment on va représenter les coordonnées géographiques. Il y a trois possibilités (en plus du fait de choisir un type `float` ou src\_java[:exports code]{double] pour les latitudes et longitudes) :

-   les représenter juste par deux nombres distincts
-   les regrouper :
    -   dans un tableau de deux cases
    -   dans une classe dédiée (par exemple `GeoCoords`).

Il s'agit de différents compromis entre facilité, simplicité et performance. Les problèmes posés par le fait de ne pas regrouper les coordonnées sont :

-   il faudra faire attention à l'ordre dans lequel on passe les paramètres à chaque fois (même si l'IDE peut nous aider)
-   pour la méthode qui implémentera l'opération «trouver les communes qui sont simultanément dans un rayon donnée d'un ensemble de points quelconques repérés par leur latitude et longitude.», il ne sera pas commode de passer ces points.

Un tableau de deux cases peut résoudre le problème, mais le compilateur ne pourra pas vérifier que le tableau fait effectivement deux cases. **ATTENTION !** Si l'on utilise un tableau comme attribut de notre classe `City`, il faut se poser la question de l'égalité et du hashage de tableaux (utiliser [Arrays.equals](https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#equals-double:A-double:A-) et non le `equals` qui est [celui de Object](https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#equals-java.lang.Object-), et [Arrays.hashCode](https://docs.oracle.com/javase/8/docs/api/java/util/Arrays.html#hashCode-double:A-) et non le `hashCode` qui est [celui de Object](https://docs.oracle.com/javase/9/docs/api/java/lang/Object.html#hashCode--)).

On peut aussi se demander si l'on a besoin d'une classe pour modéliser les ou les ensembles de communes. À priori, cela ne semble pas nécessaire.


<a id="org8065b7b"></a>

# Implémentation


<a id="org863c430"></a>

## Fonctionnalités de base


<a id="org0d82793"></a>

### equals


<a id="orge0e0966"></a>

### hashCode


<a id="orga315f7c"></a>

## Fonctionnalités demandées

Certaines opérations qui se réfèrent à une commune en particulier, on les implémentera donc sous la forme de méthodes d'instance. Pour les autres, on utilisera des méthodes de classe. Pour les ensembles de communes acceptés en argument et retournés, on doit se demander le type à utiliser. Pour le type acceptés, on voudra utiliser l'interface la plus générique : [Collection](https://docs.oracle.com/javase/8/docs/api/java/util/Collection.html). Pour les types retournés, on doit décider si l'on veut supprimer les doublons et/ou si l'on veut pouvoir faire efficacement des intersections. Dans ces cas, on utilisera des [Set](https://docs.oracle.com/javase/8/docs/api/java/util/Set.html) (par exemple [HashSet](https://docs.oracle.com/javase/8/docs/api/java/util/HashSet.html) si l'on a pas d'ordre à gérer). Sinon, on pourra utiliser des [ArrayList](https://docs.oracle.com/javase/7/docs/api/java/util/ArrayList.html) qu'on pourra retourner en tant que [List](https://docs.oracle.com/javase/7/docs/api/java/util/List.html), voire [Collection](https://docs.oracle.com/javase/7/docs/api/java/util/Collection.html). Retourner une [List](https://docs.oracle.com/javase/7/docs/api/java/util/List.html) permet de faire plus de choses, mais
