session1/exercice/data-structures-C.html

<div id="outline-container-org7ea23e0" class="outline-4">
<h4 id="org7ea23e0"><span class="section-number-4">2.2.1</span> distance d'une commune à un point</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-java">    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">double</span> <span style="color: #006699;">distanceTo</span>(<span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">latitude</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">longitude</span>){
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">R</span>= 6371e3;
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">phi1</span>=Math.toRadians(<span style="color: #0000FF;">this</span>.latitude);
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">phi2</span>=Math.toRadians(latitude);
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">deltaPhi</span>=Math.toRadians(latitude- <span style="color: #0000FF;">this</span>.latitude);
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">deltaLambda</span>= Math.toRadians(longitude- <span style="color: #0000FF;">this</span>.longitude);
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">a</span>= Math.sin(deltaPhi/2) * Math.sin(deltaPhi/2) +
            Math.cos(phi1) * Math.cos(phi2) * Math.sin(deltaLambda/2) * Math.sin(deltaLambda/2);
        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">c</span>= 2* Math.atan2(Math.sqrt(a), Math.sqrt(1-a));
        <span style="color: #0000FF;">return</span> R * c;
    }
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e268f3" class="outline-4">
<h4 id="org0e268f3"><span class="section-number-4">2.2.2</span> distance d'une commune à une autre</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-java">    <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">double</span> <span style="color: #006699;">distanceTo</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">other</span>){
        <span style="color: #0000FF;">return</span> distanceTo(other.latitude, other.longitude);
    }
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cdb9f5" class="outline-4">
<h4 id="org4cdb9f5"><span class="section-number-4">2.2.3</span> commune la plus proche</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Il faut juste faire attention à ne pas retourner l'instance elle-même
qui est évidemment la plus proche à elle-même. Les questions à se poser sont :
</p>

<ul class="org-ul">
<li>quel est le type à utiliser pour l'ensemble des communes reçues en argument ?</li>
<li>est-ce qu'on veut retourner une instance qui serait égale à
l'instance de référence, si elle est présente dans l'ensemble reçu
en argument.</li>
<li>que retourner s'il n'y a pas de communes la plus proche ! (Ce qui
arrive si et seulement si l'ensemble de communes est vide ou ne
contient que des instances égales à la commune de référence).</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #6434A3;">City</span> <span style="color: #006699;">closestCity</span>(<span style="color: #6434A3;">Collection</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">cities</span>){
    <span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">res</span> = <span style="color: #D0372D;">null</span>;
    <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">minDist</span> = <span style="color: #D0372D;">Double</span>.MAX_VALUE;
    <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span> : cities){
        <span style="color: #0000FF;">if</span>( !equals(city) ){
            <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">d</span> = distanceTo(city);
            <span style="color: #0000FF;">if</span> (d &lt; <span style="color: #6434A3;">minDist</span>){
                minDist = d;
                res = city;
            }
        }
    }
    <span style="color: #0000FF;">return</span> res;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d9af60" class="outline-4">
<h4 id="org3d9af60"><span class="section-number-4">2.2.4</span> communes dans un rayon par rapport à un point</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Comme on retourne 
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #006699;">inRadius</span>(<span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">radius</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">latitude</span>, <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">longitude</span>, <span style="color: #6434A3;">Collection</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">cities</span>){
    <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">res</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">City</span>&gt;();
    <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">City</span> <span style="color: #BA36A5;">city</span> : cities){
        <span style="color: #0000FF;">if</span>(city.distanceTo(latitude, longitude) &lt;= radius){
            res.add(city);
        }
    }
    <span style="color: #0000FF;">return</span> res;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4092e8" class="outline-4">
<h4 id="orge4092e8"><span class="section-number-4">2.2.5</span> Communes dans un rayon par rapport à un ensemble de points</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Si l'on a pas utilisé de classe dédiée (i.e. <code class="src src-java">GeoCoords</code>) ou de tableau pour regrouper les latitude et
longitude, on doit se poser la question du type utilisé pour recevoir
les coordonnées en argument. On ne voudra pas avoir deux tableaux
<code class="src src-java"><span style="color: #6434A3;">double</span>[] <span style="color: #BA36A5;">latitudes</span></code> et <code class="src src-java"><span style="color: #6434A3;">double</span>[] <span style="color: #BA36A5;">longitudes</span></code>. Il faut aussi décider de la valeur
retournée lorsque l'ensemble de points est vide. On pourrait aussi
bien décider de retourner une liste vide qu'une liste contenant toutes
les communes passées en argument.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #006699;">inRadius</span>(<span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">radius</span>, <span style="color: #6434A3;">Collection</span>&lt;<span style="color: #6434A3;">double</span>[]&gt; <span style="color: #BA36A5;">points</span>, <span style="color: #6434A3;">Collection</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">cities</span>){
    <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">res</span>= <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">City</span>&gt;(cities);
    <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">double</span>[] <span style="color: #BA36A5;">p</span> : points){
        res= inRadius(radius, p[0], p[1], res);
    }
    <span style="color: #0000FF;">return</span> res;
}       
</pre>
</div>
</div>
</div>
</div>
