session1/exercice/data-structures-C.md


<a id="orgf60a025"></a>

### distance d'une commune à un point

```java
    public double distanceTo(double latitude, double longitude){
        double R= 6371e3;
        double phi1=Math.toRadians(this.latitude);
        double phi2=Math.toRadians(latitude);
        double deltaPhi=Math.toRadians(latitude- this.latitude);
        double deltaLambda= Math.toRadians(longitude- this.longitude);
        double a= Math.sin(deltaPhi/2) * Math.sin(deltaPhi/2) +
            Math.cos(phi1) * Math.cos(phi2) * Math.sin(deltaLambda/2) * Math.sin(deltaLambda/2);
        double c= 2* Math.atan2(Math.sqrt(a), Math.sqrt(1-a));
        return R * c;
    }
```


<a id="org749e156"></a>

### distance d'une commune à une autre

```java
    public double distanceTo(City other){
        return distanceTo(other.latitude, other.longitude);
    }
```


<a id="org2a37e45"></a>

### commune la plus proche

Il faut juste faire attention à ne pas retourner l'instance elle-même qui est évidemment la plus proche à elle-même. Les questions à se poser sont :

-   quel est le type à utiliser pour l'ensemble des communes reçues en argument ?
-   est-ce qu'on veut retourner une instance qui serait égale à l'instance de référence, si elle est présente dans l'ensemble reçu en argument.
-   que retourner s'il n'y a pas de communes la plus proche ! (Ce qui arrive si et seulement si l'ensemble de communes est vide ou ne contient que des instances égales à la commune de référence).

```java
public City closestCity(Collection<City> cities){
    City res = null;
    double minDist = Double.MAX_VALUE;
    for(City city : cities){
	if( !equals(city) ){
	    double d = distanceTo(city);
	    if (d < minDist){
		minDist = d;
		res = city;
	    }
	}
    }
    return res;
}
```


<a id="orgb57efad"></a>

### communes dans un rayon par rapport à un point

Comme on retourne

```java
public static List<City> inRadius(double radius, double latitude, double longitude, Collection<City> cities){
    List<City> res = new ArrayList<City>();
    for(City city : cities){
	if(city.distanceTo(latitude, longitude) <= radius){
	    res.add(city);
	}
    }
    return res;
}
```


<a id="org1b452cb"></a>

### Communes dans un rayon par rapport à un ensemble de points

Si l'on a pas utilisé de classe dédiée (i.e. `GeoCoords`) ou de tableau pour regrouper les latitude et longitude, on doit se poser la question du type utilisé pour recevoir les coordonnées en argument. On ne voudra pas avoir deux tableaux `double[] latitudes` et `double[] longitudes`. Il faut aussi décider de la valeur retournée lorsque l'ensemble de points est vide. On pourrait aussi bien décider de retourner une liste vide qu'une liste contenant toutes les communes passées en argument.

```java
public static List<City> inRadius(double radius, Collection<double[]> points, Collection<City> cities){
    List<City> res= new ArrayList<City>(cities);
    for(double[] p : points){
	res= inRadius(radius, p[0], p[1], res);
    }
    return res;
}	
```
