session1/exercice/data-structures-C.html

<div id="outline-container-orgc27a697" class="outline-3">
<h3 id="orgc27a697"><span class="section-number-3">2.3</span> Lecture des données</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #006699;">read</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">citiesURL</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">IOException</span> {
    <span style="color: #6434A3;">List</span>&lt;<span style="color: #6434A3;">City</span>&gt; <span style="color: #BA36A5;">res</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">City</span>&gt;();
    <span style="color: #6434A3;">URL</span> <span style="color: #BA36A5;">url</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">URL</span>(citiesURL);
    <span style="color: #0000FF;">try</span>(<span style="color: #6434A3;">BufferedReader</span> <span style="color: #BA36A5;">br</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">BufferedReader</span>(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">InputStreamReader</span>(url.openStream()))){
        br.readLine(); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">on passe la ligne d'ent&#234;te</span>
        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">line</span> = br.readLine(); line != <span style="color: #D0372D;">null</span>; line = br.readLine()){
            <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">data</span> = line.split(<span style="color: #008000;">";"</span>);
            <span style="color: #0000FF;">if</span>(data.length == 3){
                <span style="color: #0000FF;">try</span>{
                    res.add(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">City</span>(data[0], Double.parseDouble(data[1]), Double.parseDouble(data[2])));
                }<span style="color: #0000FF;">catch</span>(<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>){
                    System.err.println(<span style="color: #008000;">"Erreur &#224; la lecture de la ligne:\n"</span>+line);
                    System.err.println(e);
                }
            }
        }
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Bernard Hugueney</p>
<p class="date">Created: 2019-11-14 Thu 23:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
