session1/exercice/data-structures-C.md


<a id="org84921f2"></a>

## Lecture des données

```java
public static List<City> read(String citiesURL) throws IOException {
    List<City> res = new ArrayList<City>();
    URL url = new URL(citiesURL);
    try(BufferedReader br = new BufferedReader(new InputStreamReader(url.openStream()))){
	br.readLine(); // on passe la ligne d'entête
	for(String line = br.readLine(); line != null; line = br.readLine()){
	    String[] data = line.split(";");
	    if(data.length == 3){
		try{
		    res.add(new City(data[0], Double.parseDouble(data[1]), Double.parseDouble(data[2])));
		}catch(Exception e){
		    System.err.println("Erreur à la lecture de la ligne:\n"+line);
		    System.err.println(e);
		}
	    }
	}
    }
}
```
